#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/plausibleio/checkly-e2e/runs/run-yDESMd7kEFyJGTU7

Waiting for the plan to start...

Terraform v1.3.7
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # checkly_alert_channel.pagerduty will be created
  + resource "checkly_alert_channel" "pagerduty" {
      + id                   = (known after apply)
      + send_degraded        = false
      + send_failure         = true
      + send_recovery        = true
      + ssl_expiry           = false
      + ssl_expiry_threshold = 30

      + pagerduty {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # checkly_check.plausible-io-api-health will be created
  + resource "checkly_check" "plausible-io-api-health" {
      + activated              = true
      + degraded_response_time = 15000
      + double_check           = true
      + frequency              = 1
      + group_id               = (known after apply)
      + id                     = (known after apply)
      + max_response_time      = 30000
      + name                   = "Check plausible.io/api/health"
      + type                   = "API"

      + alert_settings {
          + escalation_type = (known after apply)

          + reminders {
              + amount   = (known after apply)
              + interval = (known after apply)
            }

          + run_based_escalation {
              + failed_run_threshold = (known after apply)
            }

          + ssl_certificates {
              + alert_threshold = (known after apply)
              + enabled         = (known after apply)
            }

          + time_based_escalation {
              + minutes_failing_threshold = (known after apply)
            }
        }

      + request {
          + body_type        = "NONE"
          + follow_redirects = false
          + headers          = (known after apply)
          + method           = "GET"
          + query_parameters = (known after apply)
          + skip_ssl         = false
          + url              = "https://plausible.io/api/health"

          + assertion {
              + comparison = "EQUALS"
              + property   = "$.clickhouse"
              + source     = "JSON_BODY"
              + target     = "ok"
            }
          + assertion {
              + comparison = "EQUALS"
              + property   = "$.postgres"
              + source     = "JSON_BODY"
              + target     = "ok"
            }
          + assertion {
              + comparison = "EQUALS"
              + property   = "$.sites_cache"
              + source     = "JSON_BODY"
              + target     = "ok"
            }

          + basic_auth {
              + password = (known after apply)
              + username = (known after apply)
            }
        }
    }

  # checkly_check.plausible-io-ingestion will be created
  + resource "checkly_check" "plausible-io-ingestion" {
      + activated              = true
      + degraded_response_time = 15000
      + double_check           = true
      + frequency              = 1
      + group_id               = (known after apply)
      + id                     = (known after apply)
      + max_response_time      = 30000
      + name                   = "Check plausible.io/api/event"
      + type                   = "API"

      + alert_settings {
          + escalation_type = (known after apply)

          + reminders {
              + amount   = (known after apply)
              + interval = (known after apply)
            }

          + run_based_escalation {
              + failed_run_threshold = (known after apply)
            }

          + ssl_certificates {
              + alert_threshold = (known after apply)
              + enabled         = (known after apply)
            }

          + time_based_escalation {
              + minutes_failing_threshold = (known after apply)
            }
        }

      + request {
          + body             = jsonencode(
                {
                  + domain = "internal--checkly.com"
                  + name   = "pageview"
                  + url    = "https://internal--checkly.com/"
                  + width  = 1666
                }
            )
          + body_type        = "JSON"
          + follow_redirects = false
          + headers          = {
              + "User-Agent" = "Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_6) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/85.0.4183.121 Safari/537.36 OPR/71.0.3770.284"
            }
          + method           = "POST"
          + query_parameters = (known after apply)
          + skip_ssl         = false
          + url              = "https://plausible.io/api/event"

          + assertion {
              + comparison = "EQUALS"
              + source     = "STATUS_CODE"
              + target     = "202"
            }
          + assertion {
              + comparison = "EQUALS"
              + source     = "TEXT_BODY"
              + target     = "ok"
            }
          + assertion {
              + comparison = "IS_EMPTY"
              + property   = "x-plausible-dropped"
              + source     = "HEADERS"
            }

          + basic_auth {
              + password = (known after apply)
              + username = (known after apply)
            }
        }
    }

  # checkly_check.plausible-io-tracker-script will be created
  + resource "checkly_check" "plausible-io-tracker-script" {
      + activated              = true
      + degraded_response_time = 15000
      + double_check           = true
      + frequency              = 1
      + group_id               = (known after apply)
      + id                     = (known after apply)
      + max_response_time      = 30000
      + name                   = "Check plausible.io/js/script.js"
      + type                   = "API"

      + alert_settings {
          + escalation_type = (known after apply)

          + reminders {
              + amount   = (known after apply)
              + interval = (known after apply)
            }

          + run_based_escalation {
              + failed_run_threshold = (known after apply)
            }

          + ssl_certificates {
              + alert_threshold = (known after apply)
              + enabled         = (known after apply)
            }

          + time_based_escalation {
              + minutes_failing_threshold = (known after apply)
            }
        }

      + request {
          + body_type        = "NONE"
          + follow_redirects = false
          + headers          = (known after apply)
          + method           = "GET"
          + query_parameters = (known after apply)
          + skip_ssl         = false
          + url              = "https://plausible.io/js/script.js"

          + assertion {
              + comparison = "CONTAINS"
              + source     = "TEXT_BODY"
              + target     = "window.plausible"
            }
          + assertion {
              + comparison = "EQUALS"
              + source     = "STATUS_CODE"
              + target     = "200"
            }

          + basic_auth {
              + password = (known after apply)
              + username = (known after apply)
            }
        }
    }

  # checkly_check_group.reachability will be created
  + resource "checkly_check_group" "reachability" {
      + activated                 = true
      + concurrency               = 3
      + double_check              = true
      + id                        = (known after apply)
      + locations                 = [
          + "ap-southeast-2",
          + "eu-central-1",
          + "eu-north-1",
          + "eu-south-1",
          + "eu-west-2",
          + "us-east-1",
          + "us-west-1",
        ]
      + muted                     = true
      + name                      = "Reachability probes - via automation"
      + tags                      = [
          + "terraform",
        ]
      + use_global_alert_settings = false

      + alert_channel_subscription {
          + activated  = true
          + channel_id = (known after apply)
        }

      + alert_settings {
          + escalation_type = (known after apply)

          + reminders {
              + amount   = (known after apply)
              + interval = (known after apply)
            }

          + run_based_escalation {
              + failed_run_threshold = (known after apply)
            }

          + ssl_certificates {
              + alert_threshold = (known after apply)
              + enabled         = (known after apply)
            }

          + time_based_escalation {
              + minutes_failing_threshold = (known after apply)
            }
        }

      + api_check_defaults {
          + headers          = (known after apply)
          + query_parameters = (known after apply)
          + url              = (known after apply)

          + assertion {
              + comparison = (known after apply)
              + property   = (known after apply)
              + source     = (known after apply)
              + target     = (known after apply)
            }

          + basic_auth {
              + password = (known after apply)
              + username = (known after apply)
            }
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @cnkk, Action: `pull_request`*